const prompt = require('prompt-sync')(); // ('prompt-sync')() - рішення під помилку TypeError: prompt is not a function

let age = prompt("Скільки тобі років ? ");
// console.log (typeof age); с промта приходить строка

if (age % 1 === 0 && age > 0) { //перевіряємо чи є цілим числом і додатнім, умова % 1 === 0 виключає значення які є не числом
    
    if (age % 10 === 1 && age % 100 !== 11) { // перевіряємо чи інпут є 1 рік, 21, 31 і т.д
    console.log(age + " рік");
        } else if ((age % 10 === 2 || age % 10 === 3 || age % 10 === 4) && (age % 100 < 10 || age % 100 > 20)) { // умова для значень що закінчуються на 2,3,4 і виключаємо значення від 10 до 20, тому що 11 років, 12, 13 і т.д.
        console.log(age + " роки");
            } else {
            console.log(age + " років"); // для всіх інших значень підставляємо років
            }
} else console.log("Введене значення не є додатним та цілим числом");
