// ДЗ 1
// Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другій дві, 
// і так далі. Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".

function drawTriangle(height, symbol) {
    for (let i = 1; i <= height; i++) {
        console.log(symbol.repeat(i));
    }
}
drawTriangle(5, '*');

// ДЗ 2
// Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.

function sumOfNonMultiplesOfThree() {
    let sum = 0;
    for (let i = 1; i <= 100; i++) {
        if (i % 3 !== 0) { // Перевірка на кратність 3
            sum += i; // Додавання числа до суми
        }
    }
    return sum;
}
console.log(sumOfNonMultiplesOfThree());

// ДЗ 3:
// Написати функцію pow(x,y) яка буде приймати 2 цисла, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.
// Наприклад pow(2,3) функція поверне значення 8. 

function pow(x, y) {
    let result = 1;
    for (let i = 0; i < y; i++) {
        result *= x;
    }
    return result;
}
console.log(pow(2, 3));